expirationを設定して新しいtableを作ると、それにはdatasetのdefaultは適用されない
10day -> 1dayにしてるので、ちょっと分かりにくいが、datasetのdefaultは864000000で、tableは86400000

tf plan

```
Terraform will perform the following actions:

  # google_bigquery_table.foo will be created
  + resource "google_bigquery_table" "foo" {
      + creation_time       = (known after apply)
      + dataset_id          = "first_dataset"
      + deletion_protection = true
      + etag                = (known after apply)
      + expiration_time     = (known after apply)
      + id                  = (known after apply)
      + last_modified_time  = (known after apply)
      + location            = (known after apply)
      + num_bytes           = (known after apply)
      + num_long_term_bytes = (known after apply)
      + num_rows            = (known after apply)
      + project             = "terraform20230306"
      + schema              = jsonencode(
            [
              + {
                  + description = "The Permalink"
                  + mode        = "NULLABLE"
                  + name        = "permalink"
                  + type        = "STRING"
                },
              + {
                  + description = "State where the head office is located"
                  + mode        = "NULLABLE"
                  + name        = "state"
                  + type        = "STRING"
                },
            ]
        )
      + self_link           = (known after apply)
      + table_id            = "foo"
      + type                = (known after apply)

      + time_partitioning {
          + expiration_ms = 86400000
          + type          = "DAY"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

tf apply

```
Terraform will perform the following actions:

  # google_bigquery_table.foo will be created
  + resource "google_bigquery_table" "foo" {
      + creation_time       = (known after apply)
      + dataset_id          = "first_dataset"
      + deletion_protection = true
      + etag                = (known after apply)
      + expiration_time     = (known after apply)
      + id                  = (known after apply)
      + last_modified_time  = (known after apply)
      + location            = (known after apply)
      + num_bytes           = (known after apply)
      + num_long_term_bytes = (known after apply)
      + num_rows            = (known after apply)
      + project             = "terraform20230306"
      + schema              = jsonencode(
            [
              + {
                  + description = "The Permalink"
                  + mode        = "NULLABLE"
                  + name        = "permalink"
                  + type        = "STRING"
                },
              + {
                  + description = "State where the head office is located"
                  + mode        = "NULLABLE"
                  + name        = "state"
                  + type        = "STRING"
                },
            ]
        )
      + self_link           = (known after apply)
      + table_id            = "foo"
      + type                = (known after apply)

      + time_partitioning {
          + expiration_ms = 86400000
          + type          = "DAY"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
google_bigquery_table.foo: Creating...
google_bigquery_table.foo: Creation complete after 0s [id=projects/terraform20230306/datasets/first_dataset/tables/foo]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

table

```
{
  "kind": "bigquery#table",
  "etag": "15Zr/5U5efS6odrTyo+PLg==",
  "id": "terraform20230306:first_dataset.foo",
  "selfLink": "https://content-bigquery.googleapis.com/bigquery/v2/projects/terraform20230306/datasets/first_dataset/tables/foo",
  "tableReference": {
    "projectId": "terraform20230306",
    "datasetId": "first_dataset",
    "tableId": "foo"
  },
  "schema": {
    "fields": [
      {
        "name": "permalink",
        "type": "STRING",
        "mode": "NULLABLE",
        "description": "The Permalink"
      },
      {
        "name": "state",
        "type": "STRING",
        "mode": "NULLABLE",
        "description": "State where the head office is located"
      }
    ]
  },
  "timePartitioning": {
    "type": "DAY",
    "expirationMs": "86400000"
  },
  "numBytes": "0",
  "numLongTermBytes": "0",
  "numRows": "0",
  "creationTime": "1678083385013",
  "lastModifiedTime": "1678083385141",
  "type": "TABLE",
  "location": "US",
  "numTotalLogicalBytes": "0",
  "numActiveLogicalBytes": "0",
  "numLongTermLogicalBytes": "0"
}
```